# Задание 1
# numbers = [0, 0, 0, 0, 0]
# for i,  z in enumerate(numbers): 
#     print(i, z)

# # Задание 2
# numbers =[]
# for n in range(101):
#     numbers.append(n)
#     print(numbers)

# Задание 3
# for ngc in range(2, 497, 2):
#     print(ngc)

# Задание 4
# number =[]
# for q in range(1001):
#     number.append(q)
#     print(min(number))
#     print(max(number))
#     print(sum(number))

# Задание 5
# for w in range(101):
#     print(0)

# Доп задание 6
# a = input('a: ')
# b = input('b: ')
 
# a, b = b, a
 
# print('a =', a)
# print('b =', b)

# Доп задание 7
# while True:
#     age = int(input("Введите возраст: "))
#     if age >= 18:
#         print("Доступ разрешен")
#     else:
#         print("Извините, пользование данным ресурсом только с 18 лет")